
nc: 10  # number of classes
scales:   # [depth, width, max_channels]
  T: [0.33, 0.25, 1024]  #Mamba-YOLOv8-T summary: 6.1M parameters,   14.3GFLOPs

# Mamba-YOLO backbone 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SimpleStem, [128, 3]]         # 0-P2/4
  - [-1, 3, VSSBlock, [128]]              # 1
  - [-1, 1, VisionClueMerge, [256]]       # 2 p3/8
  - [-1, 6, VSSBlock_Omni, [256]]         # 3
  - [-1, 1, VisionClueMerge, [512]]       # 4 p4/16
  - [-1, 6, VSSBlock_Omni, [512]]         # 5
  - [-1, 1, VisionClueMerge, [1024]]      # 6 p5/32
  - [-1, 3, VSSBlock, [1024]]             # 7
  - [-1, 1, A2C2f, [1024, True, 1]]       # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9

# Mamba-YOLO PAFPN
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 5], 1, Concat, [1]]                   # 11 cat backbone P4
  - [-1, 3, XSSBlock, [512]]                    # 12 (P2/4-tiny)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 3], 1, Concat, [1]]                   # 14 cat backbone P3
  - [-1, 3, XSSBlock, [256]]                    # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 16
  - [[-1, 12], 1, Concat, [1]]                  # 17 cat head P4
  - [-1, 3, XSSBlock, [512]]                    # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 19
  - [[-1, 9], 1, Concat, [1]]                   # 20 cat head P5
  - [-1, 3, XSSBlock, [1024]]                   # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]             # Detect(P3, P4, P5)